In [1]:
import pandas as pd
# https://pandas.pydata.org/docs/reference/index.html

# Datatype of Pandas
DataFrame : 2D Table with rows and columns

Series : 1D array-like , can hold any data type such as integers, strings, floating-point numbers, and Python objects

# Creating DataFrame

In [2]:
data = {
    "name": ["Bob","Charls", "Aman"],
    "age": [25,35,15]
}
data

{'name': ['Bob', 'Charls', 'Aman'], 'age': [25, 35, 15]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     name  age
0     Bob   25
1  Charls   35
2    Aman   15

# Reading Data From Files
pd.read_csv(file_path, delimiter=','): Reads CSV (Comma Separated Value) file and returns a Pandas DataFrame

file_path: Path to csv file

delimiter: Symbol separating different columns (default=',')

In [11]:
titanic_df = pd.read_csv("titanic-Dataset.csv", delimiter = ",", header=0)

In [12]:
titanic_df.shape

(890, 12)

In [15]:
titanic_df.head()

,1,0,3,"Braund, Mr. Owen Harris",male,22,1.1,0.1,A/5 21171,7.25,Unnamed: 10,S
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
3,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
4,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

pd.read_json(file_path, delimiter=','): Reads Json file and returns a Pandas DataFrame

file_path: Path to csv file

delimiter: Symbol separating different columns (default=',')